USE eigo_db;
-- group and long use backticks because they are reserve keywords in SQL
INSERT 
IGNORE
INTO 
adjectives 
(startingLetter, `group`, english, plain, present, presentNeg, past, pastNeg) 
VALUES 

("a", "i", "good", "あたらしい", "あたらしいです", "あたらしくないです", "あたらしかった", "あたらしくなかった"),
("a", "i", "new", "あたらしい", "あたらしいです", "あたらしくないです", "あたらしかった", "あたらしくなかった"),
("a", "i", "hot", "あつい", "あついです", "あつくないです", "あつかった", "あつくなかった"),
("a", "i", "busy (people/days)", "いそがしい", "いそがしいです", "いそがしくないです", "いそがしかった", "いそがしくなかった"),

("k", "i", "good-looking", "かっこいい", "かっこいいです", "かっこよくないです", "かっこよかった", "かっこよくなかった"),
("k", "i", "frightening", "こわい", "こわいです", "こわくないです", "こわかった", "かっこよくなかった"),

("g", "i", "healthy; energetic", "げんき", "げんきです", "げんきくないです", "げんきかった", "げんきくなかった"),

("t", "i", "fun", "たのしい", "たのしいです", "たのしくないです", "たのしかった", "たのしくなかった"),
("t", "i", "small", "ちいさい", "ちいさいです", "ちいさくないです", "ちいさかった", "ちいさくなかった"),
("t", "i", "boring", "つまらない", "つまらないです", "つまらなくないです", "つまらなかった", "つまらなくなかった"),

("k", "na", "disgusted with; to dislike", "きらい", "きらいです", "きらくないです", "きらかった", "きらくなかった"),
("k", "na", "beautiful; clean", "きれい","きれいです", "きれくないです","きれかった", "きれくなかった"),

("d", "i", "to hate", "だいきらい", "だいきらいです", "だいきらくないです", "だいきらかった", "だいきらくなかった"),
("d", "i", "to love", "だいすきい", "だいすきいです", "だいすきくないです", "だいすきかった", "だいすきくなかった");


INSERT 
IGNORE
INTO 
verbs 
(startingLetter, `group`,english, short, shortPast, shortNeg, shortPastNeg, `long`, longPast, longNeg, longPastNeg, te) 
VALUES 

("a", "u", "to meet", "あう", "あった", "あわない", "あわなかった", "あいます", "あいました", "あいません", "あいませんでした", "あって"),
("a", "u","to walk", "あるく", "あるいた", "あるかない", "あるかなかった", "あるきます", "あるきました", "あるきません", "あるきませんでした", "あいて"),
("a", "u", "to go", "いく", "いった", "いかない", "いかなかった", "いきます", "いきました", "いきません", "いきませんでした", "いって"),
("a", "u", "there is", "ある", "あった", "ない", "なかった", "あります", "ありました", "ありません", "ありませんでした", "あって"),
("a", "u", "to swim", "およぐ", "およいだ", "およがない", "およがなかった", "およぎます", "およぎました", "およぎません", "およぎませんでした", "およいで"),
("a", "u", "to play", "あそぶ", "あそんだ", "あそばない", "あそばなかった", "あそびます", "あそびました", "あそびません", "あそびませんでした", "あそんで"),
("a", "u","to hurry", "いそぐ", "いそいだ", "いそがない", "いそがなかった", "いそぎます", "いそぎました", "いそぎません", "いそぎませんでした", "いそいで"),

("a", "ru", "to open (something)", "あける", "あけた", "あけない", "あけなかった", "あけます", "あけました", "あけません", "あけませんでした", "あけて"),
("a", "ru", "to get up", "おきる", "おきた", "おきない", "おきなかった", "おきます", "おきました", "おきません", "おきませんでした", "おきて"),
("a", "ru", "to teach", "おしえる", "おしえた", "おしえない", "おしえなかった", "おしえます", "おしえました", "おしえません", "おしえませんでした", "おしえて"),
("a", "ru", "to get off", "ありる", "ありた", "ありない", "ありなかった", "あります", "ありました", "ありません", "ありませんでした", "ありて"),

("m", "ru","to see", "みる", "みた", "みない", "みなかった", "みます", "みました", "みません", "みませんでした", "みて"),
("m", "u","to wait", "まつ", "まった", "またない", "またんかった", "まちます", "まちました", "まちません", "まちませんでした", "まって");

