USE eigo_db;
-- group and long use backticks because they are reserve keywords in SQL
INSERT 
INTO 
verbs 
(startingLetter, `group`,english, short, shortPast, shortNeg, shortPastNeg, `long`, longPast, longNeg, longPastNeg, te) 
VALUES 
("m", "ru","to see", "みる", "みた", "みない", "みんかった", "みます", "みました", "みません", "みませんでした", "みて"),
("m", "u","to wait", "まつ", "まった", "またない", "またんかった", "まちます", "まちました", "まちません", "まちませんでした", "まって"),
("a", "u", "to meet", "あう", "あった", "あわない", "あわなかった", "あいます", "あいました", "あいません", "あいませんでした", "あって"),
("a", "u","to walk", "あるく", "あるいた", "あるかない", "あるかなかった", "あるきます", "あるきました", "あるきません", "あるきませんでした", "あいて"),
("a", "u", "to go", "いく", "いった", "いかない", "いかなかった", "いきます", "いきました", "いきません", "いきませんでした", "いって"),
("a", "u", "there is", "ある", "あった", "ない", "なかった", "あります", "ありました", "ありません", "ありませんでした", "あって"),
("a", "u", "to swim", "およぐ", "およいだ", "およがない", "およがなかった", "およぎます", "およぎました", "およぎません", "およぎませんでした", "およいで"),
("a", "u", "to play", "あそぶ", "あそんだ", "あそばない", "あそばなかった", "あそびます", "あそびました", "あそびません", "あそびませんでした", "あそんで"),
("a", "u","to hurry", "いそぐ", "いそいだ", "いそがない", "いそがなかった", "いそぎます", "いそぎました", "いそぎません", "いそぎませんでした", "いそいで");


